Repository: ReyseMujeriego/BackupTool
Catalog: Version 2.0/EasySave/EasySave.Core/Properties/Resources.*.resx
Languages: fr

# BackToMenu
source: 0️ -- Back to the main menu
fr: 0️ -- Retour au menu principal

# BusinessSoftwareRunning
source: A business software is currently running. Backup impossible.
fr: Un logiciel métier est en cour d'éxecution. Sauvegarde impossible.

# ChangeLanguage
source: Switch the language of the system
fr: Changer le language du système

# ChangeLogsFormat
source: Change the format of the logs
fr: Changer le format des logs.

# CompleteSaveStart
source: 💾 Perform a complete backup from {0} to {1}...
fr: 💾 Effectuer une sauvegarde complète de {0} vers {1}...

# CompleteSaveSuccess
source: ✅ Full backup completed.
fr: ✅ Sauvegarde complète terminée.

source: Configure encryption
fr: Configurer le chiffrement

# ConfirmDeleteJob
source: Are you sure you want to delete this job?
fr: Êtes-vous sûr de vouloir supprimer ce job ?

# ConfirmEnableEncryption
source: Do you want to enable encryption?
fr: Voulez-vous activer le chiffrement ?

# ConfirmSaveJobChanges
source: Are you sure you want to modify?
fr: Êtes-vous sûr de vouloir modifier ?

# CreateJob
source: Create and add a Job
fr: Créer et ajouter un Job

# DecryptCustomPath
source: 2️ -- Decrypt a specific folder
fr: 2️ -- Déchiffrer un dossier spécifique

# DecryptExistingJob
source: 1️ -- Decrypt an existing Job
fr: 1️ -- Déchiffrer un Job existant

source: Decrypt files
fr: Déchiffrer des fichiers

# DecryptFilesMenu
source: 🔓 File decryption menu
fr: 🔓 Menu de déchiffrement des fichiers

# DecryptingFiles
source: 🔓 Decrypting {0} files...
fr: 🔓 Déchiffrement de {0} fichiers...

# DecryptingFiles
source: Decrypting {0} files...
fr: Déchiffrement de {0} fichiers en cours...

# DecryptionComplete
source: ✅ All files have been successfully decrypted.
fr: ✅ Tous les fichiers ont été déchiffrés avec succès.

# DecryptionCompletedJob
source: 🔓 Decryption completed for job '{0}'.
fr: 🔓 Déchiffrement terminé pour le job '{0}'.

# DecryptionCompletedPath
source: 🔓 Decryption completed for path '{0}'.
fr: 🔓 Déchiffrement terminé pour le chemin '{0}'.

# DecryptionFailed
source: ❌ Decryption failed for file {0}: {1}
fr: ❌ Échec du déchiffrement du fichier {0} : {1}

# DecryptionNoAction
source: ❌ No decryption action performed.
fr: ❌ Aucune action de déchiffrement effectuée.

# DecryptJobOrPath
source: Do you want to decrypt an existing job (O) or a specific path (N)?
fr: Voulez-vous déchiffrer un job existant (O) ou un chemin spécifique (N) ?

# DestinationCreated
source: 📂 Creating destination directory: {0}
fr: 📂 Création du répertoire de destination : {0}

# DifferentialSaveStart
source: 🆕 Performing a differential backup from {0} to {1}...
fr: 🆕 Effectuer une sauvegarde différentielle de {0} vers {1}...

# DifferentialSaveSuccess
source: ✅ Differential backup completed.
fr: ✅ Sauvegarde différentielle terminée.

# EnableEncryption
source: Do you want to enable file encryption? (y/n)
fr: Voulez-vous activer le chiffrement des fichiers ? (y/n)

# EncryptionConfigured
source: ✅ Encryption has been successfully configured.
fr: ✅ Le chiffrement a été configuré avec succès.

# EncryptionDisabled
source: ❌ Encryption is disabled.
fr: ❌ Le chiffrement est désactivé.

# EncryptionFailed
source: ❌ Encryption failed for file {0}: {1}
fr: ❌ Échec du chiffrement du fichier {0} : {1}

# EnoughJobs
source: ❌ Error: enough jobs.
fr: ❌ Error: trop de job.

# EnterDestination
source: Target folder :
fr: Dossier cible :

# EnterEncryptionKey
source: 🔑 Enter your encryption key (minimum 64 bits):
fr: 🔑 Entrez votre clé de chiffrement (64 bits minimum) :

# EnterExtensionsToEncrypt
source: 📂 Enter the file extensions to encrypt (e.g., .txt, .pdf, .docx):
fr: 📂 Entrez les extensions de fichiers à chiffrer (ex: .txt, .pdf, .docx) :

# EnterJobIndexesToExecute
source: Enter the indices of the jobs to be executed (separated by commas, eg: 1,2 or 1-3) :
fr: Entrez les indices des jobs à exécuter (séparés par des virgules, ex: 1,2 ou 1-3) :

# EnterJobIndexToExecute
source: Enter the index of the job to be executed (between 1 and 5) :
fr: Entrez l'indice du job à exécuter (entre 1 et 5) :

# EnterJobName
source: Please enter the name of the job to create :
fr: Veuillez saisir le nom du job à créer :

# EnterJobNameToDecrypt
source: 🗂 Enter the name of the Job to decrypt:
fr: 🗂 Entrez le nom du Job à déchiffrer :

# EnterJobNameToDelete
source: Name of the job to delete :
fr: Nom du job à supprimer :

# EnterJobNameToUpdate
source: Name of the job to modify :
fr: Nom du job à modifier :

# EnterJobToDecrypt
source: Enter the name of the job to decrypt:
fr: Entrez le nom du job à déchiffrer :

# EnterJobType
source: Save type (1= Complete, 2=Differential) :
fr: Type de sauvegarde (1=Complète, 2=Différentielle) :

# EnterLogsFormat
source: 📄 Choose the log format (json/xml):
fr: 📄 Choisissez le format des logs (json/xml) :

# EnterPathToDecrypt
source: 📂 Enter the path of the folder containing files to decrypt:
fr: 📂 Entrez le chemin du dossier contenant les fichiers à déchiffrer :

# EnterSource
source: Source Path :
fr: Dossier Source :

# ExecuteJob
source: Execute a Job
fr: Exécuter un Job

source: Execute multiple Jobs
fr: Exécuter plusieurs Jobs

# ExecutingJob
source: Execution of the job '{0}'
fr: Execution du job '{0}'

# ExecutingMultipleJobs
source: Starting execution of {0} jobs.
fr: Début de l'éxecution de {0} jobs.

# Exit
source: Quit
fr: Quitter

# FileCopyError
source: ❌ Error copying file {0}: {1}
fr: ❌ Erreur lors de la copie du fichier {0} : {1}

# FileDecrypted
source: ✅ File {0} decrypted in {1} ms.
fr: ✅ Fichier {0} déchiffré en {1} ms

# FileEncrypted
source: ✅ File {0} encrypted in {1} ms.
fr: ✅ Fichier {0} chiffré en {1} ms.

# FileNotEncrypted
source: ℹ️ File {0} is not encrypted.
fr: ℹ️ Le fichier {0} n'est pas chiffré.

# FileNotModified
source: 🔄 The file {0} has not been modified.
fr: 🔄 Le fichier {0} n'a pas été modifié.

# Goodbye
source: 👋 Closing the program
fr: 👋 Fermeture du programme...

# InvalidChoice
source: ❌ Invalid choice please try again
fr: ❌ Choix invalide, réessayez

# InvalidIndex
source: ❌ Error : Please enter a valid index :
fr: ❌ Erreur : Veuillez entrer un indice valide.

# InvalidIndexes
source: ❌ Error: Please enter valid indexes.
fr: ❌ Erreur : Veuillez entrer des indices valides.

source: ⚠ Invalid input!
fr: ⚠ Entrée invalide!

# InvalidLogsFormat
source: ❌ Invalid format. Please enter 'json' or 'xml'.
fr: ❌ Format invalide. Veuillez entrer 'json' ou 'xml'.

# InvalidPath
source: ❌ Path {0} is invalid or inaccessible.
fr: ❌ Le chemin {0} est invalide ou inaccessible.

# JobAdded
source: 📂 Job '{0}' added ({1}) - Source: {2} → Destination: {3}
fr: 📂 Job '{0}' ajouté ({1}) - Source: {2} → Destination: {3}

# JobDeleted
source: 🗑️ Job '{0}' deleted.
fr: 🗑️ Job '{0}' supprimé.

# JobExecutionStarted
source: ▶️ Job execution started: {0}
fr: ▶️ Exécution du job : {0}

# JobExists
source: ❌ Error : A job called {0} already exists !
fr: ❌ Erreur : Un job nommé '{0}' existe déjà !

# JobIndexNotFound
source: ❌ Error: No jobs in index {0}
fr: ❌ Erreur : Aucun job à l'index {0}

# JobLists
source: \n📁 Jobs list :\n
fr: \n📁 Liste des jobs :\n

# JobModified
source: ✏️ Job modified: {0}
fr: ✏️ Modification du job : {0}

# JobNotFound
source: ❌ Unable to delete: No job named '{0}' found.
fr: ❌ Impossible de supprimer : Aucun job nommé '{0}' trouvé.

# JobUpdated
source: 🔄 Job '{0}' successfully updated : {1} ({2}) - Source: {3} → Destination: {4}
fr: 🔄 Job '{0}' mis à jour : {1} ({2}) - Source: {3} → Destination: {4}

# ListJobs
source: List the Jobs
fr: Lister les Jobs

# LogFormatChanged
source: ✅ Log format changed: {0}
fr: ✅ Format des logs changé : {0}

# LogFormatSet
source: ✅ Log format set to: {0}
fr: ✅ Format des logs défini sur : {0}

# MenuTitle
source: Please choose an action to do
fr: Veuillez choisir une action à effectuer

# ModifiedFileCopied
source: ✅ Copied modified file: {0} → {1}
fr: ✅ Fichier modifié copié : {0} → {1}

# MultipleJobsComplete
source: ✅ All backups were completed successfully.
fr: ✅ Toutes les sauvegardes ont été effectuées avec succès.

# MultipleJobsExecuted
source: ▶️ Executing {0} selected jobs.
fr: ▶️ Exécution de {0} jobs sélectionnés.

# MultipleJobsExecuting
source: 🚀 Running sequential backup...
fr: 🚀 Exécution de la sauvegarde séquentielle...

# NewDestinationOptional
source: New target path (leave blank to keep the old one) :
fr: Nouveau dossier cible (laisser vide pour garder l'ancien) :

# NewFileCopied
source: 📁 New file copied: {0} → {1}
fr: 📁 Nouveau fichier copié : {0} → {1}

# NewNameOptional
source: New name (leave blank to keep the old one) :
fr: Nouveau nom (laisser vide pour garder l'ancien) :

# NewSourceOptional
source: New source path (leave blank to keep the old one) :
fr: Nouveau dossier source (laisser vide pour garder l'ancien) :

# NoEncryptedFiles
source: No encrypted files found in folder: {0}
fr: Aucun fichier chiffré trouvé dans le dossier : {0}

# NoFilesToDecrypt
source: ℹ️ No encrypted files found.
fr: ℹ️ Aucun fichier chiffré trouvé.

# NoJobs
source: No jobs registered
fr: Aucun job enregistré.

# NoJobsToExecute
source: Error no job will be executed
fr: Erreur aucun jobs ne sera éxecuté

# RemoveJob
source: Delete a Job
fr: Supprimer un Job

# SelectAtLeastOneJob
source: Please select at least one job.
fr: Veuillez sélectionner au moins un job.

# SelectJobToEdit
source: Please select a job to edit.
fr: Veuillez sélectionner un job à modifier.

# SourceDirectoryNotFound
source: ❌ The source directory does not exist.
fr: ❌ Le répertoire source n'existe pas.

# UnknowSaveType
source: ❌ Error: Unknown backup type.
fr: ❌ Erreur : Type de sauvegarde inconnu.

# UnrecognizedLanguage
source: ❌ Error: Language not recognized. Please enter 'fr' or 'en'.
fr: ❌ Erreur : Langue non reconnue. Veuillez entrer 'fr' ou 'en'.

# UpdateJob
source: Modify a Job
fr: Modifier un Job

# YourChoice
source: 👉 Choice :
fr: 👉 Choix :
